FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/uart_reg.h
#define UART_INTEN_RDAIEN_Pos         ( 0 )                                                /*!< UART_T::INTEN: RDAIEN Position         */
#define UART_INTEN_RDAIEN_Msk         ( 0x1ul << UART_INTEN_RDAIEN_Pos )                   /*!< UART_T::INTEN: RDAIEN Mask             */

#define UART_INTEN_THREIEN_Pos        ( 1 )                                                /*!< UART_T::INTEN: THREIEN Position        */
#define UART_INTEN_THREIEN_Msk        ( 0x1ul << UART_INTEN_THREIEN_Pos )                  /*!< UART_T::INTEN: THREIEN Mask            */

#define UART_INTEN_RLSIEN_Pos         ( 2 )                                                /*!< UART_T::INTEN: RLSIEN Position         */
#define UART_INTEN_RLSIEN_Msk         ( 0x1ul << UART_INTEN_RLSIEN_Pos )                   /*!< UART_T::INTEN: RLSIEN Mask             */

#define UART_INTEN_MODEMIEN_Pos       ( 3 )                                                /*!< UART_T::INTEN: MODEMIEN Position       */
#define UART_INTEN_MODEMIEN_Msk       ( 0x1ul << UART_INTEN_MODEMIEN_Pos )                 /*!< UART_T::INTEN: MODEMIEN Mask           */

#define UART_INTEN_RXTOIEN_Pos        ( 4 )                                                /*!< UART_T::INTEN: RXTOIEN Position        */
#define UART_INTEN_RXTOIEN_Msk        ( 0x1ul << UART_INTEN_RXTOIEN_Pos )                  /*!< UART_T::INTEN: RXTOIEN Mask            */

#define UART_INTEN_BUFERRIEN_Pos      ( 5 )                                                /*!< UART_T::INTEN: BUFERRIEN Position      */
#define UART_INTEN_BUFERRIEN_Msk      ( 0x1ul << UART_INTEN_BUFERRIEN_Pos )                /*!< UART_T::INTEN: BUFERRIEN Mask          */

#define UART_INTEN_WKIEN_Pos          ( 6 )                                                /*!< UART_T::INTEN: WKIEN Position          */
#define UART_INTEN_WKIEN_Msk          ( 0x1ul << UART_INTEN_WKIEN_Pos )                    /*!< UART_T::INTEN: WKIEN Mask              */

#define UART_INTEN_LINIEN_Pos         ( 8 )                                                /*!< UART_T::INTEN: LINIEN Position         */
#define UART_INTEN_LINIEN_Msk         ( 0x1ul << UART_INTEN_LINIEN_Pos )                   /*!< UART_T::INTEN: LINIEN Mask             */

#define UART_INTEN_TOCNTEN_Pos        ( 11 )                                               /*!< UART_T::INTEN: TOCNTEN Position        */
#define UART_INTEN_TOCNTEN_Msk        ( 0x1ul << UART_INTEN_TOCNTEN_Pos )                  /*!< UART_T::INTEN: TOCNTEN Mask            */

#define UART_INTEN_ATORTSEN_Pos       ( 12 )                                               /*!< UART_T::INTEN: ATORTSEN Position       */
#define UART_INTEN_ATORTSEN_Msk       ( 0x1ul << UART_INTEN_ATORTSEN_Pos )                 /*!< UART_T::INTEN: ATORTSEN Mask           */

#define UART_INTEN_ATOCTSEN_Pos       ( 13 )                                               /*!< UART_T::INTEN: ATOCTSEN Position       */
#define UART_INTEN_ATOCTSEN_Msk       ( 0x1ul << UART_INTEN_ATOCTSEN_Pos )                 /*!< UART_T::INTEN: ATOCTSEN Mask           */

#define UART_INTEN_TXPDMAEN_Pos       ( 14 )                                               /*!< UART_T::INTEN: TXPDMAEN Position       */
#define UART_INTEN_TXPDMAEN_Msk       ( 0x1ul << UART_INTEN_TXPDMAEN_Pos )                 /*!< UART_T::INTEN: TXPDMAEN Mask           */

#define UART_INTEN_RXPDMAEN_Pos       ( 15 )                                               /*!< UART_T::INTEN: RXPDMAEN Position       */
#define UART_INTEN_RXPDMAEN_Msk       ( 0x1ul << UART_INTEN_RXPDMAEN_Pos )                 /*!< UART_T::INTEN: RXPDMAEN Mask           */

#define UART_INTEN_ABRIEN_Pos         ( 18 )                                               /*!< UART_T::INTEN: ABRIEN Position         */
#define UART_INTEN_ABRIEN_Msk         ( 0x1ul << UART_INTEN_ABRIEN_Pos )                   /*!< UART_T::INTEN: ABRIEN Mask             */

#define UART_INTEN_TXENDIEN_Pos       ( 22 )                                               /*!< UART_T::INTEN: TXENDIEN Position       */
#define UART_INTEN_TXENDIEN_Msk       ( 0x1ul << UART_INTEN_TXENDIEN_Pos )                 /*!< UART_T::INTEN: TXENDIEN Mask           */

#define UART_FIFO_RXRST_Pos           ( 1 )                                                /*!< UART_T::FIFO: RXRST Position           */
#define UART_FIFO_RXRST_Msk           ( 0x1ul << UART_FIFO_RXRST_Pos )                     /*!< UART_T::FIFO: RXRST Mask               */

#define UART_FIFO_TXRST_Pos           ( 2 )                                                /*!< UART_T::FIFO: TXRST Position           */
#define UART_FIFO_TXRST_Msk           ( 0x1ul << UART_FIFO_TXRST_Pos )                     /*!< UART_T::FIFO: TXRST Mask               */

#define UART_FIFO_RFITL_Pos           ( 4 )                                                /*!< UART_T::FIFO: RFITL Position           */
#define UART_FIFO_RFITL_Msk           ( 0xful << UART_FIFO_RFITL_Pos )                     /*!< UART_T::FIFO: RFITL Mask               */

#define UART_FIFO_RXOFF_Pos           ( 8 )                                                /*!< UART_T::FIFO: RXOFF Position           */
#define UART_FIFO_RXOFF_Msk           ( 0x1ul << UART_FIFO_RXOFF_Pos )                     /*!< UART_T::FIFO: RXOFF Mask               */

#define UART_FIFO_RTSTRGLV_Pos        ( 16 )                                               /*!< UART_T::FIFO: RTSTRGLV Position        */
#define UART_FIFO_RTSTRGLV_Msk        ( 0xful << UART_FIFO_RTSTRGLV_Pos )                  /*!< UART_T::FIFO: RTSTRGLV Mask            */

#define UART_LINE_WLS_Pos             ( 0 )                                                /*!< UART_T::LINE: WLS Position             */
#define UART_LINE_WLS_Msk             ( 0x3ul << UART_LINE_WLS_Pos )                       /*!< UART_T::LINE: WLS Mask                 */

#define UART_LINE_NSB_Pos             ( 2 )                                                /*!< UART_T::LINE: NSB Position             */
#define UART_LINE_NSB_Msk             ( 0x1ul << UART_LINE_NSB_Pos )                       /*!< UART_T::LINE: NSB Mask                 */

#define UART_LINE_PBE_Pos             ( 3 )                                                /*!< UART_T::LINE: PBE Position             */
#define UART_LINE_PBE_Msk             ( 0x1ul << UART_LINE_PBE_Pos )                       /*!< UART_T::LINE: PBE Mask                 */

