FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/uart_reg.h
#define UART_BAUD_BRD_Pos             ( 0 )                                                /*!< UART_T::BAUD: BRD Position             */
#define UART_BAUD_BRD_Msk             ( 0xfffful << UART_BAUD_BRD_Pos )                    /*!< UART_T::BAUD: BRD Mask                 */

#define UART_BAUD_EDIVM1_Pos          ( 24 )                                               /*!< UART_T::BAUD: EDIVM1 Position          */
#define UART_BAUD_EDIVM1_Msk          ( 0xful << UART_BAUD_EDIVM1_Pos )                    /*!< UART_T::BAUD: EDIVM1 Mask              */

#define UART_BAUD_BAUDM0_Pos          ( 28 )                                               /*!< UART_T::BAUD: BAUDM0 Position          */
#define UART_BAUD_BAUDM0_Msk          ( 0x1ul << UART_BAUD_BAUDM0_Pos )                    /*!< UART_T::BAUD: BAUDM0 Mask              */

#define UART_BAUD_BAUDM1_Pos          ( 29 )                                               /*!< UART_T::BAUD: BAUDM1 Position          */
#define UART_BAUD_BAUDM1_Msk          ( 0x1ul << UART_BAUD_BAUDM1_Pos )                    /*!< UART_T::BAUD: BAUDM1 Mask              */

#define UART_IRDA_TXEN_Pos            ( 1 )                                                /*!< UART_T::IRDA: TXEN Position            */
#define UART_IRDA_TXEN_Msk            ( 0x1ul << UART_IRDA_TXEN_Pos )                      /*!< UART_T::IRDA: TXEN Mask                */

#define UART_IRDA_TXINV_Pos           ( 5 )                                                /*!< UART_T::IRDA: TXINV Position           */
#define UART_IRDA_TXINV_Msk           ( 0x1ul << UART_IRDA_TXINV_Pos )                     /*!< UART_T::IRDA: TXINV Mask               */

#define UART_IRDA_RXINV_Pos           ( 6 )                                                /*!< UART_T::IRDA: RXINV Position           */
#define UART_IRDA_RXINV_Msk           ( 0x1ul << UART_IRDA_RXINV_Pos )                     /*!< UART_T::IRDA: RXINV Mask               */

#define UART_ALTCTL_BRKFL_Pos         ( 0 )                                                /*!< UART_T::ALTCTL: BRKFL Position         */
#define UART_ALTCTL_BRKFL_Msk         ( 0xful << UART_ALTCTL_BRKFL_Pos )                   /*!< UART_T::ALTCTL: BRKFL Mask             */

#define UART_ALTCTL_LINRXEN_Pos       ( 6 )                                                /*!< UART_T::ALTCTL: LINRXEN Position       */
#define UART_ALTCTL_LINRXEN_Msk       ( 0x1ul << UART_ALTCTL_LINRXEN_Pos )                 /*!< UART_T::ALTCTL: LINRXEN Mask           */

#define UART_ALTCTL_LINTXEN_Pos       ( 7 )                                                /*!< UART_T::ALTCTL: LINTXEN Position       */
#define UART_ALTCTL_LINTXEN_Msk       ( 0x1ul << UART_ALTCTL_LINTXEN_Pos )                 /*!< UART_T::ALTCTL: LINTXEN Mask           */

#define UART_ALTCTL_RS485NMM_Pos      ( 8 )                                                /*!< UART_T::ALTCTL: RS485NMM Position      */
#define UART_ALTCTL_RS485NMM_Msk      ( 0x1ul << UART_ALTCTL_RS485NMM_Pos )                /*!< UART_T::ALTCTL: RS485NMM Mask          */

#define UART_ALTCTL_RS485AAD_Pos      ( 9 )                                                /*!< UART_T::ALTCTL: RS485AAD Position      */
#define UART_ALTCTL_RS485AAD_Msk      ( 0x1ul << UART_ALTCTL_RS485AAD_Pos )                /*!< UART_T::ALTCTL: RS485AAD Mask          */

#define UART_ALTCTL_RS485AUD_Pos      ( 10 )                                               /*!< UART_T::ALTCTL: RS485AUD Position      */
#define UART_ALTCTL_RS485AUD_Msk      ( 0x1ul << UART_ALTCTL_RS485AUD_Pos )                /*!< UART_T::ALTCTL: RS485AUD Mask          */

#define UART_ALTCTL_ADDRDEN_Pos       ( 15 )                                               /*!< UART_T::ALTCTL: ADDRDEN Position       */
#define UART_ALTCTL_ADDRDEN_Msk       ( 0x1ul << UART_ALTCTL_ADDRDEN_Pos )                 /*!< UART_T::ALTCTL: ADDRDEN Mask           */

#define UART_ALTCTL_ABRIF_Pos         ( 17 )                                               /*!< UART_T::ALTCTL: ABRIF Position         */
#define UART_ALTCTL_ABRIF_Msk         ( 0x1ul << UART_ALTCTL_ABRIF_Pos )                   /*!< UART_T::ALTCTL: ABRIF Mask             */

#define UART_ALTCTL_ABRDEN_Pos        ( 18 )                                               /*!< UART_T::ALTCTL: ABRDEN Position        */
#define UART_ALTCTL_ABRDEN_Msk        ( 0x1ul << UART_ALTCTL_ABRDEN_Pos )                  /*!< UART_T::ALTCTL: ABRDEN Mask            */

#define UART_ALTCTL_ABRDBITS_Pos      ( 19 )                                               /*!< UART_T::ALTCTL: ABRDBITS Position      */
#define UART_ALTCTL_ABRDBITS_Msk      ( 0x3ul << UART_ALTCTL_ABRDBITS_Pos )                /*!< UART_T::ALTCTL: ABRDBITS Mask          */

#define UART_ALTCTL_ADDRMV_Pos        ( 24 )                                               /*!< UART_T::ALTCTL: ADDRMV Position        */
#define UART_ALTCTL_ADDRMV_Msk        ( 0xfful << UART_ALTCTL_ADDRMV_Pos )                 /*!< UART_T::ALTCTL: ADDRMV Mask            */

#define UART_FUNCSEL_FUNCSEL_Pos      ( 0 )                                                /*!< UART_T::FUNCSEL: FUNCSEL Position      */
#define UART_FUNCSEL_FUNCSEL_Msk      ( 0x3ul << UART_FUNCSEL_FUNCSEL_Pos )                /*!< UART_T::FUNCSEL: FUNCSEL Mask          */

#define UART_FUNCSEL_TXRXDIS_Pos      ( 3 )                                                /*!< UART_T::FUNCSEL: TXRXDIS Position      */
#define UART_FUNCSEL_TXRXDIS_Msk      ( 0x1ul << UART_FUNCSEL_TXRXDIS_Pos )                /*!< UART_T::FUNCSEL: TXRXDIS Mask          */

#define UART_LINCTL_SLVEN_Pos         ( 0 )                                                /*!< UART_T::LINCTL: SLVEN Position         */
#define UART_LINCTL_SLVEN_Msk         ( 0x1ul << UART_LINCTL_SLVEN_Pos )                   /*!< UART_T::LINCTL: SLVEN Mask             */

#define UART_LINCTL_SLVHDEN_Pos       ( 1 )                                                /*!< UART_T::LINCTL: SLVHDEN Position       */
#define UART_LINCTL_SLVHDEN_Msk       ( 0x1ul << UART_LINCTL_SLVHDEN_Pos )                 /*!< UART_T::LINCTL: SLVHDEN Mask           */

#define UART_LINCTL_SLVAREN_Pos       ( 2 )                                                /*!< UART_T::LINCTL: SLVAREN Position       */
#define UART_LINCTL_SLVAREN_Msk       ( 0x1ul << UART_LINCTL_SLVAREN_Pos )                 /*!< UART_T::LINCTL: SLVAREN Mask           */

#define UART_LINCTL_SLVDUEN_Pos       ( 3 )                                                /*!< UART_T::LINCTL: SLVDUEN Position       */
#define UART_LINCTL_SLVDUEN_Msk       ( 0x1ul << UART_LINCTL_SLVDUEN_Pos )                 /*!< UART_T::LINCTL: SLVDUEN Mask           */

#define UART_LINCTL_MUTE_Pos          ( 4 )                                                /*!< UART_T::LINCTL: MUTE Position          */
#define UART_LINCTL_MUTE_Msk          ( 0x1ul << UART_LINCTL_MUTE_Pos )                    /*!< UART_T::LINCTL: MUTE Mask              */

#define UART_LINCTL_SENDH_Pos         ( 8 )                                                /*!< UART_T::LINCTL: SENDH Position         */
#define UART_LINCTL_SENDH_Msk         ( 0x1ul << UART_LINCTL_SENDH_Pos )                   /*!< UART_T::LINCTL: SENDH Mask             */

#define UART_LINCTL_IDPEN_Pos         ( 9 )                                                /*!< UART_T::LINCTL: IDPEN Position         */
#define UART_LINCTL_IDPEN_Msk         ( 0x1ul << UART_LINCTL_IDPEN_Pos )                   /*!< UART_T::LINCTL: IDPEN Mask             */

#define UART_LINCTL_BRKDETEN_Pos      ( 10 )                                               /*!< UART_T::LINCTL: BRKDETEN Position      */
#define UART_LINCTL_BRKDETEN_Msk      ( 0x1ul << UART_LINCTL_BRKDETEN_Pos )                /*!< UART_T::LINCTL: BRKDETEN Mask          */

#define UART_LINCTL_LINRXOFF_Pos      ( 11 )                                               /*!< UART_T::LINCTL: LINRXOFF Position      */
#define UART_LINCTL_LINRXOFF_Msk      ( 0x1ul << UART_LINCTL_LINRXOFF_Pos )                /*!< UART_T::LINCTL: LINRXOFF Mask          */

#define UART_LINCTL_BITERREN_Pos      ( 12 )                                               /*!< UART_T::LINCTL: BITERREN Position      */
#define UART_LINCTL_BITERREN_Msk      ( 0x1ul << UART_LINCTL_BITERREN_Pos )                /*!< UART_T::LINCTL: BITERREN Mask          */

#define UART_LINCTL_BRKFL_Pos         ( 16 )                                               /*!< UART_T::LINCTL: BRKFL Position         */
#define UART_LINCTL_BRKFL_Msk         ( 0xful << UART_LINCTL_BRKFL_Pos )                   /*!< UART_T::LINCTL: BRKFL Mask             */

#define UART_LINCTL_BSL_Pos           ( 20 )                                               /*!< UART_T::LINCTL: BSL Position           */
#define UART_LINCTL_BSL_Msk           ( 0x3ul << UART_LINCTL_BSL_Pos )                     /*!< UART_T::LINCTL: BSL Mask               */

#define UART_LINCTL_HSEL_Pos          ( 22 )                                               /*!< UART_T::LINCTL: HSEL Position          */
#define UART_LINCTL_HSEL_Msk          ( 0x3ul << UART_LINCTL_HSEL_Pos )                    /*!< UART_T::LINCTL: HSEL Mask              */

