FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/uart_reg.h
#define UART_LINCTL_PID_Pos           ( 24 )                                               /*!< UART_T::LINCTL: PID Position           */
#define UART_LINCTL_PID_Msk           ( 0xfful << UART_LINCTL_PID_Pos )                    /*!< UART_T::LINCTL: PID Mask               */

#define UART_LINSTS_SLVHDETF_Pos      ( 0 )                                                /*!< UART_T::LINSTS: SLVHDETF Position      */
#define UART_LINSTS_SLVHDETF_Msk      ( 0x1ul << UART_LINSTS_SLVHDETF_Pos )                /*!< UART_T::LINSTS: SLVHDETF Mask          */

#define UART_LINSTS_SLVHEF_Pos        ( 1 )                                                /*!< UART_T::LINSTS: SLVHEF Position        */
#define UART_LINSTS_SLVHEF_Msk        ( 0x1ul << UART_LINSTS_SLVHEF_Pos )                  /*!< UART_T::LINSTS: SLVHEF Mask            */

#define UART_LINSTS_SLVIDPEF_Pos      ( 2 )                                                /*!< UART_T::LINSTS: SLVIDPEF Position      */
#define UART_LINSTS_SLVIDPEF_Msk      ( 0x1ul << UART_LINSTS_SLVIDPEF_Pos )                /*!< UART_T::LINSTS: SLVIDPEF Mask          */

#define UART_LINSTS_SLVSYNCF_Pos      ( 3 )                                                /*!< UART_T::LINSTS: SLVSYNCF Position      */
#define UART_LINSTS_SLVSYNCF_Msk      ( 0x1ul << UART_LINSTS_SLVSYNCF_Pos )                /*!< UART_T::LINSTS: SLVSYNCF Mask          */

#define UART_LINSTS_BRKDETF_Pos       ( 8 )                                                /*!< UART_T::LINSTS: BRKDETF Position       */
#define UART_LINSTS_BRKDETF_Msk       ( 0x1ul << UART_LINSTS_BRKDETF_Pos )                 /*!< UART_T::LINSTS: BRKDETF Mask           */

#define UART_LINSTS_BITEF_Pos         ( 9 )                                                /*!< UART_T::LINSTS: BITEF Position         */
#define UART_LINSTS_BITEF_Msk         ( 0x1ul << UART_LINSTS_BITEF_Pos )                   /*!< UART_T::LINSTS: BITEF Mask             */

#define UART_BRCOMP_BRCOMP_Pos        ( 0 )                                                /*!< UART_T::BRCOMP: BRCOMP Position        */
#define UART_BRCOMP_BRCOMP_Msk        ( 0x1fful << UART_BRCOMP_BRCOMP_Pos )                /*!< UART_T::BRCOMP: BRCOMP Mask            */

#define UART_BRCOMP_BRCOMPDEC_Pos     ( 31 )                                               /*!< UART_T::BRCOMP: BRCOMPDEC Position     */
#define UART_BRCOMP_BRCOMPDEC_Msk     ( 0x1ul << UART_BRCOMP_BRCOMPDEC_Pos )               /*!< UART_T::BRCOMP: BRCOMPDEC Mask         */

#define UART_WKCTL_WKCTSEN_Pos        ( 0 )                                                /*!< UART_T::WKCTL: WKCTSEN Position        */
#define UART_WKCTL_WKCTSEN_Msk        ( 0x1ul << UART_WKCTL_WKCTSEN_Pos )                  /*!< UART_T::WKCTL: WKCTSEN Mask            */

#define UART_WKCTL_WKDATEN_Pos        ( 1 )                                                /*!< UART_T::WKCTL: WKDATEN Position        */
#define UART_WKCTL_WKDATEN_Msk        ( 0x1ul << UART_WKCTL_WKDATEN_Pos )                  /*!< UART_T::WKCTL: WKDATEN Mask            */

#define UART_WKCTL_WKRFRTEN_Pos       ( 2 )                                                /*!< UART_T::WKCTL: WKRFRTEN Position       */
#define UART_WKCTL_WKRFRTEN_Msk       ( 0x1ul << UART_WKCTL_WKRFRTEN_Pos )                 /*!< UART_T::WKCTL: WKRFRTEN Mask           */

#define UART_WKCTL_WKRS485EN_Pos      ( 3 )                                                /*!< UART_T::WKCTL: WKRS485EN Position      */
#define UART_WKCTL_WKRS485EN_Msk      ( 0x1ul << UART_WKCTL_WKRS485EN_Pos )                /*!< UART_T::WKCTL: WKRS485EN Mask          */

#define UART_WKCTL_WKTOUTEN_Pos       ( 4 )                                                /*!< UART_T::WKCTL: WKTOUTEN Position       */
#define UART_WKCTL_WKTOUTEN_Msk       ( 0x1ul << UART_WKCTL_WKTOUTEN_Pos )                 /*!< UART_T::WKCTL: WKTOUTEN Mask           */

#define UART_WKSTS_CTSWKF_Pos         ( 0 )                                                /*!< UART_T::WKSTS: CTSWKF Position         */
#define UART_WKSTS_CTSWKF_Msk         ( 0x1ul << UART_WKSTS_CTSWKF_Pos )                   /*!< UART_T::WKSTS: CTSWKF Mask             */

#define UART_WKSTS_DATWKF_Pos         ( 1 )                                                /*!< UART_T::WKSTS: DATWKF Position         */
#define UART_WKSTS_DATWKF_Msk         ( 0x1ul << UART_WKSTS_DATWKF_Pos )                   /*!< UART_T::WKSTS: DATWKF Mask             */

#define UART_WKSTS_RFRTWKF_Pos        ( 2 )                                                /*!< UART_T::WKSTS: RFRTWKF Position        */
#define UART_WKSTS_RFRTWKF_Msk        ( 0x1ul << UART_WKSTS_RFRTWKF_Pos )                  /*!< UART_T::WKSTS: RFRTWKF Mask            */

#define UART_WKSTS_RS485WKF_Pos       ( 3 )                                                /*!< UART_T::WKSTS: RS485WKF Position       */
#define UART_WKSTS_RS485WKF_Msk       ( 0x1ul << UART_WKSTS_RS485WKF_Pos )                 /*!< UART_T::WKSTS: RS485WKF Mask           */

#define UART_WKSTS_TOUTWKF_Pos        ( 4 )                                                /*!< UART_T::WKSTS: TOUTWKF Position        */
#define UART_WKSTS_TOUTWKF_Msk        ( 0x1ul << UART_WKSTS_TOUTWKF_Pos )                  /*!< UART_T::WKSTS: TOUTWKF Mask            */

#define UART_DWKCOMP_STCOMP_Pos       ( 0 )                                                /*!< UART_T::DWKCOMP: STCOMP Position       */
#define UART_DWKCOMP_STCOMP_Msk       ( 0xfffful << UART_DWKCOMP_STCOMP_Pos )              /*!< UART_T::DWKCOMP: STCOMP Mask           */

/**@}*/ /* UART_CONST */
/**@}*/ /* end of UART register group */
/**@}*/ /* end of REGISTER group */

#endif /* __UART_REG_H__ */
